benchmark/rhoPorousSimpleFoam/cells_7885751/constant/MRFZones
// ************************************************************************* //

FoamFile
{
    object               MRFZones;
    format               ascii;
    location             "constant";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

0
(
);
