benchmark/rhoPorousSimpleFoam/cells_7885751/constant/polyMesh/blockMeshDict
// ************************************************************************* //

FoamFile
{
    object               blockMeshDict;
    format               ascii;
    location             "constant";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

vertices
(
    ( 2659.95 -297.14 -270.213 )
    ( 3638.73 -297.14 -270.213 )
    ( 3638.73  676 -270.213 )
    ( 2659.95  676 -270.213 )
    ( 2659.95 -297.14 357.162 )
    ( 3638.73 -297.14 357.162 )
    ( 3638.73  676 357.162 )
    ( 2659.95  676 357.162 )
);
blocks
(
//    hex (0 1 2 3 4 5 6 7) (122 116 78) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (240 240 140) simpleGrading (1 1 1)
);
edges
(
);
patches
(
);
mergePatchPairs
(
);
