benchmark/rhoPorousSimpleFoam/cells_7885751/system/decomposeParDict
// ************************************************************************* //

FoamFile
{
    object               decomposeParDict;
    format               ascii;
    location             "system";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

numberOfSubdomains   1440;

method               scotch;

// ************************************************************************* //