benchmark/rhoPorousSimpleFoam/cells_7885751/system/fvSchemes
// ************************************************************************* //

FoamFile
{
    object               fvSchemes;
    format               ascii;
    location             "system";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

ddtSchemes
{
    default              steadyState;
}

gradSchemes
{
    default              Gauss linear;
}

divSchemes
{
    div(phi,U)           bounded Gauss upwind;
    div(phi,k)           bounded Gauss upwind;
    div(phi,h)           bounded Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,K)           bounded Gauss upwind;
    div(phi,epsilon)     bounded Gauss upwind;
}

laplacianSchemes
{
    default              Gauss linear corrected;
}

interpolationSchemes
{
    default              linear;
}

snGradSchemes
{
    default              corrected;
}

fluxRequired
{
    default              no;
    p                    ;
}
