benchmark/rhoPorousSimpleFoam/cells_7885751/system/fvSolution
// ************************************************************************* //

FoamFile
{
    object               fvSolution;
    format               ascii;
    location             "system";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

solvers
{
    epsilon
    {
        relTol               0.01;
        preconditioner       DILU;
        tolerance            1.0e-12;
        solver               PBiCG;
    }
    k
    {
        relTol               0.01;
        preconditioner       DILU;
        tolerance            1.0e-12;
        solver               PBiCG;
    }
    h
    {
        relTol               0.01;
        preconditioner       DILU;
        tolerance            1.0e-12;
        solver               PBiCG;
    }
    U
    {
        relTol               0.01;
        preconditioner       DILU;
        tolerance            1.0e-12;
        solver               PBiCG;
    }

    U2
    {
        relTol               0.0001;
        maxIter              20;
        agglomerator         faceAreaPair;
        cacheAgglomeration   off;
        nCellsInCoarsestLevel 1000;
        solver               GAMG;
        smoother             GaussSeidel;
        tolerance            1.0e-9;
        mergeLevels          2;
    }


    p
    {
        relTol               0.001;
        preconditioner       DIC;
        tolerance            1.0e-12;
        solver               PCG;
        maxIter              500;
    }

    p2
    {
        relTol               0.0001;
        maxIter              20;
        agglomerator         faceAreaPair;
        cacheAgglomeration   off;
        nCellsInCoarsestLevel 1000;
        solver               GAMG;
        smoother             GaussSeidel;
        tolerance            1.0e-9;
        mergeLevels          2;
    }
}

SIMPLE
{
    rhoMax               rhoMax [1 -3 0 0 0 0 0] 1.0e+3;
    rhoMin               rhoMin [1 -3 0 0 0 0 0] 1.0e-3;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p 1.0e-7;
        U 1.0e-7;
    }
}

relaxationFactors
{
    fields
    {
        p                    0.3;
        rho                  0.005;
    }
    equations
    {
        h                    0.3;
        k                    0.05;
        U                    0.1;
        epsilon              0.05;
    }
}
